Revit 2027 API
ParameterTypeId.EditCurveOffsetParam Property
 "Offset From Attachment"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EditCurveOffsetParam { get; }
Public Shared ReadOnly Property EditCurveOffsetParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EditCurveOffsetParam {
	ForgeTypeId^ get ();
}
static member EditCurveOffsetParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace